// //Задание 1
// //Выведите в консоль 2 раза слово «Привет».

let hello = 1;
while (hello <= 2) {
    console.log("Привет");
    hello++
}

// //Задание 2
// //Выведите в консоль цифры от 1 до 5.

let number = 1;
while (number <= 5) {
    console.log(number);
    number++
}

// //Задание 3
// //Выведите в консоль числа от 7 до 22.

let number3 = 7;
while (number3 <= 22) {
    console.log(number3);
    number3++
}

// //Задание 4
// //Есть объект (назовем его obj), который содержит следующие пары ключ-значение:
// //"Коля" : '200'
// //"Вася" : '300'
// //"Петя" : '400'
// //Эти пары представляют собой имена сотрудников и их зарплаты в долларах. Ваша задача написать код, который будет проходиться по всем записям этого объекта и выводить информацию о каждом сотруднике в формате: "имя сотрудника" — зарплата "сумма" долларов.
// //Для итерации по объекту используйте цикл for-in.

let obj = {
    Коля: '200',
    Вася: '300',
    Петя: '400'
}
for (let key in obj) {
    console.log(`${key} - зарплата ${obj[key]} долларов`);
}

// //Задание 5
// //Дано число n=1000. Ваша задача — делить его на 2 до тех пор, пока результат деления не станет меньше 50.
// //Определите, какое число получится в результате.
// //Вычислите количество итераций (проходов цикла), которые потребовались для достижения результата, и запишите это количество в переменную num.

let n = 1000;
let num = 0;
while (n >= 50) {
    n /= 2;
    num++
}
console.log(num);

// //Задание 6
// //В вашей компании пятница является отчетным днем.
// //Нужно написать программу, которая: считает дни месяца по датам, определяет, какой день пятница, выводит сообщение с напоминанием, что нужно подготовить еженедельный отчет.
// //Условия задачи:
// //Создайте переменную, которая хранит в себе номер первой пятницы месяца (число от 1 до 7).
// //Выведите на каждую пятницу месяца (включая полученную) сообщение следующего вида: "Сегодня пятница, ...-е число. Необходимо подготовить отчет."
// //Исходите из того, что в нашем месяце 31 день. Должно вывестись от 4 до 5 сообщений с напоминаниями по разным датам.

let friday = Number(prompt("Введите порядковый номер первой пятницы месяца от 1 до 7"));
do {
    console.log(`Сегодня пятница, ${friday}-е число. Необходимо подготовить отчет`);
    friday += 7;
}
while (friday <= 31);

//Дополнительные задания
//Задание 1
//Дано число k = 100. Ваша задача — вычитать из него 7 до тех пор, пока результат вычитания не станет меньше 0. Определите, какое число получится в результате. Вычислите количество итераций (проходов цикла), которые потребовались для достижения результата, и запишите это количество в переменную iterations.

k = 100;
iteration = 0;
while (k > 0) {
  k -= 7;
  iteration++;
}
console.log(iteration);

//Задание 2
//Создайте массив months с названиями всех месяцев года. Напишите программу, которая выводит название каждого месяца и его порядковый номер в году.

// let month = {
//   январь: 1,
//   февраль: 2,
//   март: 3,
//   апрель: 4,
//   май: 5,
//   июнь: 6,
//   июль: 7,
//   август: 8,
//   сентябрь: 9,
//   октябрь: 10,
//   ноябрь: 11,
//   декабрь: 12,
// };
// for (let key in month) {
//   console.log(`${key} имеет ${month[key]} порядковый номер в году`);
// }

const myArray = [
  "январь",
  "февраль",
  "март",
  "апрель",
  "май",
  "июнь",
  "июль",
  "август",
  "сентябрь",
  "октябрь",
  "ноябрь",
  "декабрь",
];
for (let i = 0; i < myArray.length; i++) {
  console.log(`Порядковый номер месяца ${myArray[i]} - ${i + 1}`);
}

//Задание 3
//Создайте объект, описывающий книгу, с такими свойствами как "название", "автор", "год издания", "жанр". Напишите код, который выводит все свойства этого объекта в консоль.

let book = {
  TitleBook: "Мастер и Маргарита",
  Author: "Михаил Булгаков",
  yearPubl: 1966,
  Genre: "Роман",
};
for (let key in book) {
  console.log(`${key}: ${book[key]}`);
}

//Задание 4
//Создайте массив из 10 случайных чисел. Напишите код, который находит минимальное число в массиве и выводит его в консоль.

let randomNumbers = [];
for (let i = 0; i < 10; i++) {
  let randomNumber = Math.floor(Math.random() * 100);
  randomNumbers.push(randomNumber);
}
console.log("Создали массив из 10 случайных чисел от 0 до 100") 
console.log(randomNumbers);

let r = 100;
for (let i = 0; i < randomNumbers.length; i++) {
  if (Number(r) >= randomNumbers[i]) {
    r = randomNumbers[i];
    console.log(`${r} second`);
  } else {
    console.log(`${r} first`);
  }
}
console.log(`Минимальное число в массиве - ${r}`);
